{
  "1": "Berserker's Fury Шанс і шкода криту +65 фізичної атаки +25% шансу криту Унікальний атрибут: +40% шкоди критичного удару Унікальний пасив — Загибель: критичні удари надають 5% додаткової фізичної атаки на 2 секунди.",
  "2": "Blade of Despair Найвища фізична атака +160 фізичної атаки +5% швидкості руху Унікальний пасив — Відчай: завдання шкоди ворогам (крім міньйонів) з HP нижче 50% збільшує фізичну атаку на 25% на 2 секунди (діє до нанесення шкоди).",
  "3": "Blade of the Heptaseas Найкращий для асасінів +70 фізичної атаки +250 HP Унікальний атрибут: +15 фізичного проникнення Унікальний пасив — Засідка: якщо протягом 5 секунд не завдано та не отримано шкоди (не рахуючи міньйонів і кріпів), наступна базова атака завдасть додатково 160 (+40% загальної фізичної атаки) фізичної шкоди та сповільнить ціль на 40% на 1,5 секунди.",
  "4": "Попередник: Ice Force.",
  "5": "Demon Hunter Sword Вбивця танків +35 фізичної атаки +20% швидкості атаки Унікальний пасив — Поглинання: базові атаки завдають 8% від поточного HP цілі як додаткову фізичну шкоду (максимум 60 проти міньйонів). Унікальний пасив — Пожирання: кожна базова атака відновлює 20 (+4×рівень героя) HP. Ефект зменшується вдвічі проти міньйонів.",
  "6": "Endless Battle Покращені базові атаки +60 фізичної атаки +250 HP +10% зменшення часу відновлення +5% швидкості руху +5 регенерації мани Унікальний пасив — Божественне правосуддя: після використання навички наступна базова атака протягом 3 секунд завдає (60% загальної фізичної атаки) додаткової істинної шкоди та відновлює 80 (+40% загальної фізичної атаки) HP (відновлення 1,5 секунди).",
  "7": "Fleeting Time Зменшення КД ультимейту +30 адаптивної атаки +600 HP +15% зменшення часу відновлення Унікальний пасив — Потік часу: вбивство або допомога у вбивстві героя зменшує поточний час відновлення ультимейту на 30%.",
  "8": "Golden Staff Підсилення ефектів атаки +55 фізичної атаки +15% швидкості атаки Унікальний пасив — Стрімкість: кожен 1% додаткового шансу криту перетворюється на 1% додаткової швидкості атаки. Унікальний пасив — Нескінченний удар: після кожних 2 базових атак без криту швидкість атаки наступної базової атаки збільшується на 80% (обмеження швидкості атаки також збільшується до 500%) та додатково активує ефекти атаки 2 рази.",
  "9": "Попередник: Scarlet Phantom.",
  "10": "Попередники: Tooth of Greed та Scarlet Phantom.",
  "11": "Hunter Strike Короткий прискорення +80 фізичної атаки +10% зменшення часу відновлення Унікальний атрибут: +15 фізичного проникнення Унікальний пасив — Відплата: завдання шкоди одному й тому ж ворожому герою чи кріпу 5 разів поспіль надає 50% додаткової швидкості руху, що поступово зменшується протягом 3 секунд (відновлення 8 секунд).",
  "12": "Malefic Gun Збільшення дальності атаки +40 фізичної атаки +20% швидкості атаки Унікальний пасив — Пробивання броні: збільшує фізичне проникнення на 30%. Унікальний пасив — Зловісна енергія: збільшує дальність базової атаки на 12%. При попаданні в ціль швидкість руху збільшується на 10% на 0,5 секунди.",
  "13": "Malefic Roar Високе фізичне проникнення +60 фізичної атаки Унікальний пасив — Пробивання броні: збільшує фізичне проникнення на 30%. Унікальний пасив — Руйнівник: під час атаки на ворога отримує 0,1% додаткового фізичного проникнення за кожну одиницю фізичного захисту ворога, максимум 30%.",
  "14": "Rose Gold Meteor Щит при низькому HP +30 фізичної атаки +20% швидкості атаки +10% вампіризму Унікальний пасив — Луска дракона: кожні 4 одиниці додаткової фізичної атаки збільшують гібридний захист на 1, максимум 50 (ефект зменшується вдвічі, якщо основна роль — не Боєць). Унікальний пасив — Лінія життя: при отриманні шкоди, що зменшує HP нижче 30%, отримує щит (120×рівень героя), що збільшується з рівнем, та 50% швидкості руху, що швидко зменшується протягом 3 секунд. Відновлення 60 секунд.",
  "15": "Sea Halberd Зменшення зцілення +80 фізичної атаки +20% швидкості атаки Унікальний пасив — Згубне життя: завдання шкоди цілі зменшує ефект щита та регенерації HP на ній до 60% від звичайного на 3 секунди. Унікальний пасив — Покарання: збільшує шкоду на 8% проти ворожих героїв з більшим додатковим HP.",
  "16": "Sky Piercer Найкращий для добивання +60 адаптивної атаки +15 швидкості руху Унікальний пасив — Летальність: після завдання шкоди ворожому герою добиває його, якщо HP нижче 4%. Отримує 10 зарядів Летальності за кожне вбивство та втрачає 30% поточних зарядів за кожну смерть. Кожен заряд збільшує поріг HP для добивання на 0,1%, максимум 80 зарядів.",
  "17": "Попередник: Bloodlust Axe.",
  "18": "Wind of Nature Імунітет до фізичної шкоди +30 фізичної атаки +20% швидкості атаки +10% вампіризму Унікальний актив — Пісня вітру: стає імунним до всієї фізичної шкоди на 2 секунди (тривалість зменшується вдвічі, якщо основна роль — не Стрілець; відновлення 90 секунд).",
  "19": "Windtalker Масова шкода +35% швидкості атаки +20% шансу криту +20 швидкості руху Унікальний пасив — Тайфун: кожні 5–2 секунди (зменшується на 0,2 секунди за кожну базову атаку) наступна базова атака вражає до 3 ворожих одиниць, завдаючи 150–362 магічної шкоди. (Ця атака може бути критичною, шкода збільшується на 200% проти міньйонів.)",
  "20": "Winter Crown Тимчасова невразливість +45 адаптивної атаки +400 HP +5% зменшення часу відновлення Унікальний актив — Заморозка: стає замороженим, невразливим та імунним до шкоди на 2 секунди (відновлення 100 секунд). Не можна рухатися чи використовувати навички під час заморозки, але вже застосовані навички не будуть перервані.",
  "21": "Fury Hammer +35 фізичної атаки Унікальний атрибут: +12 фізичного проникнення",
  "22": "Legion Sword +60 фізичної атаки",
  "23": "Regular Spear +20 фізичної атаки +10% швидкості атаки",
  "24": "Попередник: Wild Sword.",
  "25": "Swift Crossbow +20% швидкості атаки Унікальний пасив — Арбалет: кожна базова атака завдає 40 додаткової адаптивної шкоди. Унікальний пасив — Імпульс: базові атаки надають 3% додаткової швидкості атаки на 3 секунди, максимум 5 зарядів.",
  "26": "Dagger +15 фізичної атаки",
  "27": "Ogre Tomahawk +25 фізичної атаки +230 HP",
  "28": "Iron Hunting Bow +10 фізичної атаки +5% зменшення часу відновлення",
  "29": "Javelin +8% шансу криту",
  "30": "Knife +10% швидкості атаки",
  "31": "Vampire Mallet +8 фізичної атаки +8% вампіризму",
  "32": "Expert Gloves +30 адаптивної атаки",
  "33": "Power Potion Унікальний пасив — Збільшення сили: автоматично використовується після купівлі, надає 30 фізичної атаки та 15% вампіризму на 120 секунд. Може мати лише один ефект зілля одночасно.",
  "34": "Blood Wings Щит з прискоренням +90 магічної сили Унікальний пасив — Охоронець: отримує щит у розмірі 800 (+100% магічної сили), який відновлюється через 20 секунд після пошкодження. Щит також надає 30 швидкості руху поки діє та 150 швидкості руху на 1 секунду після зникнення.",
  "35": "Clock of Destiny Для магічних танків +45 магічної сили +400 HP +400 мани +10% зменшення часу відновлення Унікальний пасив — Доля: надає 4,5 (+0,5×рівень героя) гібридного захисту на 5 секунд при завданні магічної шкоди ворожим героям, до 6 зарядів (1 заряд кожні 0,4 секунди). Унікальний пасив — Дар: коли HP падає нижче 50%, відновлює 15% HP протягом 3 секунд. Коли мана падає нижче 50%, відновлює 15% мани протягом 3 секунд. Відновлення: 60 секунд.",
  "36": "Concentrated Energy Підсилення тривалої шкоди +70 магічної сили +400 HP Унікальний атрибут: +20% гібридного вампіризму Унікальний пасив — Перезарядка: збільшує магічну силу на 5 після завдання магічної шкоди (до 6 зарядів, 1 заряд кожні 0,4 секунди). При повних зарядах збільшує магічну шкоду на 12% на 5 секунд.",
  "37": "Попередник: Astral Wand.",
  "38": "Enchanted Talisman Регенерація мани та зменшення КД +50 магічної сили +250 HP +20% зменшення часу відновлення Унікальний пасив — Джерело мани: регенерує 15% від максимальної мани кожні 10 секунд. Унікальний пасив — Магічна майстерність: максимальне зменшення часу відновлення збільшується на 5%.",
  "39": "Feather of Heaven Магічні базові атаки +55 магічної сили +20% швидкості атаки +10% вампіризму +5% зменшення часу відновлення Унікальний пасив — Чари: кожна базова атака завдає додатково 50 (+30% загальної магічної сили) магічної шкоди. Унікальний пасив — Імпульс: базові атаки надають 6% додаткової швидкості атаки на 3 секунди, максимум 5 зарядів.",
  "40": "Flask of the Oasis Захист союзників +60 магічної сили +300 HP +10% зменшення часу відновлення Унікальний атрибут: +12% ефекту зцілення Унікальний пасив — Благословення: при використанні навички зцілення або щита, якщо HP цілі нижче 35% або впаде нижче 35% протягом 3 секунд, ціль отримає щит (100×рівень героя), що діє 3 секунди. Активація також зменшує час відновлення навичок на 2 секунди. (Цей ефект може діяти на одну ціль лише раз на 60 секунд.)",
  "41": "Ice Queen Wand Сповільнення при попаданні навичкою +75 магічної сили +10% вампіризму заклинань +300 HP +7% швидкості руху Унікальний пасив — Скутий льодом: коли навичка завдає шкоди ворожому герою, також сповільнює його на 10% на 2 секунди (до 3 зарядів). Відновлення ефекту 1 секунда.",
  "42": "Lightning Truncheon Масова шкода +75 магічної сили +400 мани +10% зменшення часу відновлення Унікальний пасив — Резонанс: кожні 6 секунд наступна навичка створює відлуння, завдаючи 170 (+85% магічної сили) додаткової магічної шкоди всім ворогам у радіусі.",
  "43": "Попередник: Necklace of Durance.",
  "44": "Попередник: Disaster Truncheon.",
  "45": "Попередники: Shadow Twinblades та Calamity Reaper.",
  "46": "Winter Crown Тимчасова невразливість +45 адаптивної атаки +400 HP +5% зменшення часу відновлення Унікальний актив — Заморозка: стає замороженим, невразливим та імунним до шкоди на 2 секунди (відновлення 100 секунд). Не можна рухатися чи використовувати навички під час заморозки, але вже застосовані навички не будуть перервані.",
  "47": "Tome of Evil +35 магічної сили +4 регенерації мани +8% зменшення часу відновлення",
  "48": "Book of Sages +8 магічної сили +5% зменшення часу відновлення",
  "49": "Exotic Veil +30 магічної сили +5% швидкості руху",
  "50": "Mystic Container +15 магічної сили +8% вампіризму заклинань",
  "51": "Mystery Codex +15 магічної сили",
  "52": "Power Crystal +280 мани",
  "53": "Elegant Gem +300 HP +380 мани Унікальний пасив — Дар: коли HP падає нижче 50%, відновлює 15% HP протягом 3 секунд. Коли мана падає нижче 50%, відновлює 15% мани протягом 3 секунд. Відновлення: 60 секунд.",
  "54": "Magic Necklace +2 регенерації мани",
  "55": "Magic Wand +45 магічної сили",
  "56": "Lantern of Hope +20 магічної сили +4% швидкості руху +2% зменшення часу відновлення Унікальний пасив — Ліхтар надії: характеристики предмета масштабуються з рівнем героя.",
  "57": "Magic Potion Унікальний пасив — Збільшення потужності: автоматично використовується після купівлі, збільшує магічну силу на 30 та зменшення часу відновлення на 10% на 120 секунд. Може мати лише один ефект зілля одночасно.",
  "58": "Flower of Hope +5% адаптивної атаки Унікальний пасив — Квітка надії: кожні 6 секунд наступна навичка або базова атака завдає додатково 60 (+30% загальної фізичної атаки) (+30% загальної магічної сили) магічної шкоди.",
  "59": "Antique Cuirass Зменшення фізичної атаки +920 HP +40 фізичного захисту +4 регенерації HP Унікальний пасив — Стримування: при отриманні шкоди від навички зменшує фізичну шкоду нападника на 6% на 2 секунди (до 3 зарядів).",
  "60": "Athena's Shield Захист від магічного бурсту +900 HP +48 магічного захисту +2 регенерації HP Унікальний пасив — Щит: при отриманні магічної шкоди від навичок або базових атак ворожого героя зменшує отриману магічну шкоду на 25% на 3 секунди (включно зі шкодою, що активувала ефект). Ефект відновлюється через 5 секунд поза боєм.",
  "61": "Blade Armor Відображення шкоди +80 фізичного захисту Унікальний атрибут: +20% зменшення шкоди криту Унікальний пасив — Клинкова броня: при отриманні базової атаки завдає нападнику фізичну шкоду, що дорівнює 30 (+2% загального фізичного захисту)% від вхідної шкоди (до зменшення шкоди), та сповільнює на 15% на 1 секунду.",
  "62": "Brute Force Breastplate Атака, швидкість, зменшення контролю +800 HP +20 фізичного захисту +10% зменшення часу відновлення Унікальний пасив — Груба сила: щосекунди після завдання шкоди отримує 8 додаткової адаптивної атаки та 2% додаткової швидкості руху на 4 секунди, до 6 зарядів. При повних зарядах отримує 25% додаткового зменшення тривалості контролю.",
  "63": "Попередник: Twilight Armor.",
  "64": "Cursed Helmet Виживання та зачистка лінії +1200 HP +20 магічного захисту Унікальний пасив — Палаюча душа: завдає (1,2% загального HP) магічної шкоди ворогам поблизу за секунду. Шкода збільшується на 125 (+15×рівень героя)% проти кріпів та міньйонів. Унікальний пасив — Прокляття: завдання шкоди Палаючою душею зменшує гібридний захист цілі на 3 на 3 секунди. До 3 зарядів.",
  "65": "Dominance Ice Зменшення зцілення +40 фізичного захисту +40 магічного захисту +5% швидкості руху Унікальний пасив — Щит фортеці: за кожного ворожого героя в радіусі 5 одиниць гібридний захист збільшується на 8, максимум 40. Унікальний пасив — Згубне життя: отримання шкоди зменшує ефект щита та регенерації HP нападника до 60% від звичайного на 1 секунду.",
  "66": "Guardian Helmet Постійна регенерація HP +1800 HP +20 регенерації HP Унікальний пасив — Відновлення: через 5 секунд поза боєм відновлює (2,5% загального HP) HP за секунду. Унікальний пасив — Захисник: при отриманні понад 500 шкоди за раз відновлює 20 (+0,3% загального HP)% HP від надлишкової шкоди понад цю кількість.",
  "67": "Immortality Самовоскресіння +850 HP +15 фізичного захисту Унікальний пасив — Безсмертний: воскресає через 2,5 секунди після смерті та отримує 16% максимального HP і щит, що поглинає 150 (+70×рівень героя) шкоди. Щит діє 3 секунди. Відновлення ефекту 210 секунд.",
  "68": "Oracle Покращена регенерація +850 HP +20 фізичного захисту +20 магічного захисту +10% зменшення часу відновлення Унікальний пасив — Благословення: отримані ефекти щита та регенерації HP збільшені на 30%.",
  "69": "Queen's Wings Відплата при низькому HP +750 HP +30 адаптивної атаки +10% зменшення часу відновлення +10% вампіризму заклинань Унікальний пасив — Демонізація: коли HP падає нижче 40%, отримує 30% зменшення шкоди на 3 секунди та зменшує час відновлення навичок на 2 секунди. Відновлення ефекту 60 секунд. Унікальний пасив — Непокора: за кожен 1% втраченого HP шкода збільшується на 0,25%, максимум 15%.",
  "70": "Radiant Armor Зменшення магічної шкоди +950 HP +40 магічного захисту +12 регенерації HP Унікальний пасив — Святе благословення: отримання магічної шкоди надає 5 (+1×рівень героя) магічного захисту на 5 секунд, до 6 зарядів (1 заряд кожні 0,4 секунди).",
  "71": "Thunder Belt Шкода для танків +600 HP +15 фізичного захисту +15 магічного захисту +20 швидкості руху Унікальний пасив — Блискавка: кожні 4 секунди наступна базова атака завдає 50 (+100% додаткового фізичного захисту) (+100% додаткового магічного захисту) додаткової істинної шкоди цілі та ворогам поблизу, ненадовго сповільнюючи їх на 99%. Гібридний захист назавжди збільшується на 1 при влучанні по ворожому герою. (Ефект зменшений до 50% для Стрільців та Магів.)",
  "72": "Black Ice Shield +20 фізичного захисту +20 магічного захисту Унікальний пасив — Щит фортеці: за кожного ворожого героя в радіусі 5 одиниць гібридний захист збільшується на 4, максимум 20.",
  "73": "Dreadnaught Armor +30 фізичного захисту Унікальний пасив — Стримування: при отриманні шкоди від навички зменшує фізичну шкоду нападника на 4% на 2 секунди (до 3 зарядів).",
  "74": "Silence Robe +540 HP +23 магічного захисту",
  "75": "Steel Legplates +35 фізичного захисту",
  "76": "Healing Necklace +4 регенерації HP",
  "77": "Leather Jerkin +14 фізичного захисту",
  "78": "Magic Resist Cloak +14 магічного захисту",
  "79": "Vitality Crystal +230 HP",
  "80": "Rock Potion Унікальний пасив — Збільшення витривалості: після купівлі надає 500 максимального HP та 5% зменшення шкоди на 120 секунд. Може мати лише один ефект зілля одночасно.",
  "81": "Arcane Boots Магічне проникнення +40 швидкості руху +15 магічної сили +10 магічного проникнення",
  "82": "Demon Shoes Швидка регенерація мани +40 швидкості руху +10 регенерації мани Унікальний пасив — Містика: вбивство або допомога у вбивстві ворожого міньйона відновлює 4% мани. (Допомога зараховується, коли міньйон помирає протягом 2 секунд після отримання шкоди від героя.)",
  "83": "Magic Shoes Зменшення КД +40 швидкості руху +10% зменшення часу відновлення +150 HP",
  "84": "Rapid Boots Швидкість руху +65 швидкості руху +35% зменшення уповільнення +12 регенерації HP Унікальний пасив — Побічний ефект: втрачає 20 швидкості руху на 5 секунд при завданні або отриманні шкоди.",
  "85": "Swift Boots Швидкість атаки +40 швидкості руху +15% швидкості атаки",
  "86": "Tough Boots Зменшення тривалості контролю +40 швидкості руху +18 магічного захисту Унікальний пасив — Стійкість: тривалість контролю та уповільнення зменшена на 25%.",
  "87": "Warrior Boots Зростаючий фізичний захист +40 швидкості руху +18 фізичного захисту Унікальний пасив — Доблесть: отримує 4 додаткового фізичного захисту на 3 секунди при отриманні фізичної шкоди, максимум 20.",
  "88": "Boots +20 швидкості руху",
  "89": "Allow Throw Унікальний пасив — Довіра: дозволяє союзному Jawhead кинути вас.",
  "90": "Broken Heart Унікальний пасив — Розбите серце: стає імунним до Місячного вальсу союзного Cecilion в цьому матчі.",
  "91": "Throw Forbidden Унікальний пасив — Нерушима гора: стає імунним до Катапульти союзного Jawhead в цьому матчі.",
  "92": "Bloody Retribution Унікальний актив — шкода Кари проти кріпів та міньйонів збільшена до 150%. При використанні на ворожому герою завдає 100 істинної шкоди та викрадає HP в розмірі 300 плюс 24% додаткового HP на 3 секунди. Кара покращується, коли загальна кількість вбивств кріпів, героїв та допомог досягає 5.",
  "93": "Flame Retribution Унікальний актив — шкода Кари проти кріпів та міньйонів збільшена до 150%. При використанні на ворожому герою завдає 100 істинної шкоди та викрадає 71-120 фізичної атаки та магічної сили (масштабується з рівнем) на 3 секунди. Кара покращується, коли загальна кількість вбивств кріпів, героїв та допомог досягає 5.",
  "94": "Ice Retribution Унікальний актив — шкода Кари проти кріпів та міньйонів збільшена до 150%. При використанні на ворожому герою завдає 100 істинної шкоди та викрадає 52-80 швидкості руху (масштабується з рівнем) на 3 секунди. Кара покращується, коли загальна кількість вбивств кріпів, героїв та допомог досягає 5.",
  "95": "Wishing Lantern Проти високого HP +75 магічної сили +400 мани +10% зменшення часу відновлення Унікальний пасив — Богиня метеликів: за кожні 800 магічної шкоди, завданої ворожому герою (до зменшення шкоди), призивається Богиня метеликів, яка атакує ворожого героя, завдаючи магічну шкоду в розмірі 8% від його поточного HP.",
  "96": "Azure Blade +5 регенерації мани +5% зменшення часу відновлення Унікальний пасив — Суд: після використання навички наступна базова атака протягом 3 секунд завдає 50 додаткової істинної шкоди (відновлення 1,5 секунди).",
  "97": "Calamity Reaper Покращені базові атаки +70 магічної сили +100 мани +6 регенерації мани +10% зменшення часу відновлення Унікальний пасив — Біда: протягом 3 секунд після використання навички наступна базова атака завдає додаткову істинну шкоду в розмірі 120% магічної сили з відновленням 1,5 секунди.",
  "98": "Holy Crystal Максимальна магічна сила +185 магічної сили Унікальний пасив — Таємниця: отримує 21%-35% додаткової магічної сили (масштабується з рівнем).",
  "99": "Ares Belt +600 HP",
  "100": "Наступник: Chastise Pauldron.",
  "101": "Magic Blade +35 фізичної атаки +10% вампіризму Унікальний пасив — Лінія життя: при отриманні шкоди, що зменшує HP нижче 30%, отримує щит (+60×рівень героя), що збільшується з рівнем, та 50% швидкості руху, що швидко зменшується протягом 3 секунд. Відновлення ефекту 60 секунд.",
  "102": "Hero's Ring +15 магічної сили +60 HP",
  "103": "Molten Essence +25 фізичного захисту +25 магічного захисту"
}
