[
  {
    "version": "2.1.40",
    "release_date": "2025-12-18",
    "new_hero": {
      "name": "Sora",
      "title": "Shifting Cloud",
      "description": "Hero Feature: Adaptable cloud warrior with multiple combat styles.",
      "skills": [
        {
          "type": "Passive",
          "name": "Mystic Surge",
          "description": "Sora can use his Ultimate to switch between Tank and Assassin styles. After ascending, dealing damage to heroes grants Cloudstep stacks that unlock different Ultimate effects.\n\nTank Style: Physical Attack converts to Max HP proportionally.\n\nAssassin Style: Converts a portion of Max HP into Physical Attack."
        },
        {
          "type": "Skill 1",
          "name": "Sundering Strike",
          "description": "Sora strikes twice, dealing Physical Damage, then lunges forward and follows up with a straight punch.\n\nTank Style: Cannot move freely during the skill. Stuns the target when lunging forward.\n\nAssassin Style: Can move freely during the skill. Deals 2 additional strikes and extends the range of the lunge."
        },
        {
          "type": "Skill 2",
          "name": "Skyfall",
          "description": "Sora leaps forward, stops when hitting an enemy hero or reaching max range to deal Physical Damage and slow the enemy.\n\nTank Style: The leap knocks enemies Airborne and knocks them back to the landing point. Landing at max range also knocks nearby enemies Airborne.\n\nAssassin Style: The leap passes through the enemy hero and deals large AOE Damage and slows the enemies when reaching max range, and can be cast again within a short duration on hit."
        },
        {
          "type": "Ultimate",
          "name": "Shifting Skies",
          "description": "When fully stacked, swipe right to ascend into Tank Style. And after a brief delay, deals Physical Damage to all nearby enemies and pulls them in with a spinning vortex.\n\nWhen fully stacked, swipe left to ascend into Assassin style. Gains a brief bonus Movement Speed and becomes untargetable, then continuously deals Physical Damage to all nearby enemies.\n\nStormbind (Tank Style Ultimate): Sora leaps and strikes the target area 5 times, stunning enemies. He can move freely during this skill.\n\nHeaven's Wrath (Assassin Style Ultimate): Sora leaps and strikes the target area 15 times. He can move freely during this skill."
        }
      ]
    },
    "hero_adjustments": {
      "Angela": {
        "summary": "Increased the duration of Angela's Ultimate when attached to allies and the cast frequency of Skill 1. Additionally, the cooldown now runs while attached. To balance, we've reduced the Movement Speed boost of the Passive and increased the cooldown of the Ultimate.",
        "skills": [
          {
            "name": "Passive-Smart Heart",
            "balance": "NERF",
            "changes": [
              "Movement Speed Boost per Stack: 7.5% >> 5%"
            ]
          },
          {
            "name": "Skill 1-Love Waves",
            "balance": "BUFF",
            "changes": [
              "Cooldown: 7s >> 8s",
              "New Effect: When attached, this skill's cooldown is reduced by 50%."
            ]
          },
          {
            "name": "Ultimate-Heartguard",
            "balance": "ADJUST",
            "changes": [
              "Cooldown: 20s >>60s",
              "Attaching State Duration: 12s >>20s",
              "Shield Duration: 6s >> the shield remains until detached",
              "Adjusted the cooldown mechanics to start immediately after casting the Ultimate."
            ]
          }
        ]
      },
      "Atlas": {
        "summary": "Increased the stability of Atlas's Skill 1 damage.",
        "skills": [
          {
            "name": "Skill 1-Annihilate",
            "balance": "BUFF",
            "changes": [
              "Damage: 215-390 (+60% Total Magic Power) >> 400-600 (+100% Total Magic Power)",
              "New Effect: Each target can be damaged only once."
            ]
          }
        ]
      },
      "Aurora": {
        "summary": "Aurora was slightly underperforming among Mages. Therefore, we've enhanced her overall ability scaling.",
        "skills": [
          {
            "name": "Skill 2-Frosty Breeze",
            "balance": "BUFF",
            "changes": [
              "New Effect: Gain 0.06s additional freezing time for every 100 Magic Power."
            ]
          }
        ]
      },
      "Barats": {
        "summary": "The payoff for landing Barats' Ultimate was low, while missing it was too punishing. Therefore, we've made some adjustments to improve this.",
        "skills": [
          {
            "name": "Ultimate-Detona's Welcome",
            "balance": "BUFF",
            "changes": [
              "New Effect: If the Ultimate misses, its cooldown will be reduced by 50%.",
              "New Effect: If the Ultimate hits, Detona immediately gains max stacks of Big Guy.",
              "Effect Change: 60% cooldown refund when the cast is canceled >> 50% cooldown refund when the cast is canceled",
              "Removed Effect: Detona gains Big Guy stacks upon respawn.",
              "HP Bonus of the Additional Damage: 1.8% Total HP >> 5% Total HP"
            ]
          }
        ]
      },
      "Estes": {
        "summary": "Enhanced Estes's sustained healing and the ability to protect fragile heroes.",
        "skills": [
          {
            "name": "Skill 1-Moonlight Immersion",
            "balance": "BUFF",
            "changes": [
              "Sustained Healing: 250-400 (+60% Total Magic Power) >> 360-585 (+90% Total Magic Power)",
              "Duration of Hybrid Defense Increase: 3s >> 5s",
              "Cooldown: 11-7s >> 11-8.5s",
              "Mana Cost: 110-210 >> 60-120"
            ]
          },
          {
            "name": "Ultimate-Blessing of Moon Goddess",
            "balance": "BUFF",
            "changes": [
              "Enhanced Moonlight Immersion doubles the Hybrid Defense increase.",
              "Optimized the skill description."
            ]
          }
        ]
      },
      "Freya": {
        "summary": "Freya's combat effectiveness was relatively weak without her Ultimate. To improve balance while preserving her highlight performance during Ultimate, we've reduced its cooldown.",
        "skills": [
          {
            "name": "Ultimate-Valkyrie Descent",
            "balance": "BUFF",
            "changes": [
              "Cooldown: 54-46s (Starts on cast) >> 34-26s (Starts after cast)",
              "Gains 50% damage reduction while diving down.",
              "Slightly increased the speed when diving down."
            ]
          }
        ]
      },
      "Gatotkaca": {
        "summary": "Compared to other Tank heroes, the control duration of Gatotkaca's Skill 2 was too long and easy to cast.",
        "skills": [
          {
            "name": "Skill 2-Unbreakable",
            "balance": "NERF",
            "changes": [
              "Taunt Duration: Fixed 1.5s >> 0.9-1.5s (scales with channel time)",
              "Sprint Distance: 3-4.4 >> 2.2-4.4"
            ]
          }
        ]
      },
      "Granger": {
        "summary": "Granger has been crowding out other Marksmen in the Gold Lane. To address this, we've reduced his early to mid game scaling and damage output.",
        "skills": [
          {
            "name": "Skill 1-Rhapsody",
            "balance": "NERF",
            "changes": [
              "Base Damage: 60-120 >> 60-100",
              "No longer deals additional damage to minions and creeps."
            ]
          }
        ]
      },
      "Grock": {
        "summary": "Grock boasted incredible durability and could gain Control Immunity from his Passive. Therefore, we've slightly reduced his ability. Grock can still cast his skills uninterrupted, but he will be affected by control effects.",
        "skills": [
          {
            "name": "Passive-Bastion of StoneBastion of Stone",
            "balance": "NERF",
            "changes": [
              "Removed Effect: Gains Control Immunity while casting skills.",
              "New Effect: The skill cannot be interrupted."
            ]
          },
          {
            "name": "Ultimate-Tectonic ChargeTectonic Charge",
            "balance": "BUFF",
            "changes": [
              "New Effect: Gains Control Immunity while charging."
            ]
          }
        ]
      },
      "Harith": {
        "summary": "Harith has been crowding out other Marksmen in the Gold Lane. To address this, his mid to late game damage has been reduced, while his survivability has been increased to adjust his power curve.",
        "skills": [
          {
            "name": "Skill 2-Chrono Dash",
            "balance": "NERF",
            "changes": [
              "Enhanced Basic Attack Damage Bonus: 90% Total Physical Attack (+90% Total Magic Power) >> 100% Total Physical Attack (+60% Total Magic Power)",
              "Shield: 120-270 (+100% Total Magic Power) >> 120-270 (+120% Total Magic Power) (up to 3 stacks).",
              "Enhanced Basic Attacks only deal 50-100 and normal Basic Attack damage to Turrets."
            ]
          }
        ]
      },
      "Hayabusa": {
        "summary": "Hayabusa's Skill 2 allowed him to reach the backline too easily. For balance, we've reduced its distance. To compensate, we've also increased his skill cast frequency.",
        "skills": [
          {
            "name": "Skill 2-Ninjutsu Quad Shadow",
            "balance": "NERF",
            "changes": [
              "Reduced Hayabusa's and his phantoms' travel distance by 20%.",
              "Cooldown: 20-16s >> 16-14s"
            ]
          },
          {
            "name": "Ultimate-Ougi Shadow Kill",
            "balance": "BUFF",
            "changes": [
              "Cooldown: 50s >> 40s"
            ]
          }
        ]
      },
      "Johnson": {
        "summary": "Adjusted Johnson's Damage Bonus. Damage dealt directly by his wrench and car form now scales with Physical Defense to improve damage output for defense-build Johnson.\nThe Sustained Damage dealt by the electrified zones left behind by Skill 2 and the Ultimate's explosion continues to scale with Magic Power.",
        "skills": [
          {
            "name": "Full Throttle",
            "balance": "BUFF",
            "changes": [
              "Explosion Damage Bonus Upon Hitting Enemies: 160%-240% Total Magic Power >> 240%-360% Τοtal Physical Defense"
            ]
          }
        ]
      },
      "Khufra": {
        "summary": "Improved Khufra's poke capability in the early to mid game.",
        "skills": [
          {
            "name": "Passive-Spell Curse",
            "balance": "BUFF",
            "changes": [
              "Cooldown: 12s >> 8s"
            ]
          }
        ]
      },
      "Leomord": {
        "summary": "Leomord's Passive relied on enemies being at low health to be effective, which didn't align with our design expectations. We want Leomord to take the initiative by gaining Oath Keeper energy through combat to deal Crit Damage while recovering HP for sustainability, making him a knight capable of charging into battle. We've also increased Skill 1's damage against creeps to improve Leomord's jungle clearing efficiency. To balance this, we've removed the shield granted in skill 1.",
        "skills": [
          {
            "name": "Passive-The Oath Keeper",
            "balance": "REVAMP",
            "changes": [
              "Leomord's Basic Attacks and skills gain 25 Oath Keeper energy for each target damaged. When the energy reaches 100, his next Basic Attack deals 200% Crit Damage and recovers 100 (+10* Hero Level) (+12% Extra Max HP) HP.",
              "Leomord's Basic Attacks cannot normally Crit, and every 1% Crit Chance is converted to 1% Crit Damage.",
              "Mounted State: Each Oath Keeper energy gain is increased by 200%."
            ]
          },
          {
            "name": "Skill 1-Momentum",
            "balance": "BUFF",
            "changes": [
              "Removed the effect of gaining a shield.",
              "New Effect: Damage against creeps increases to 200%."
            ]
          }
        ]
      },
      "Lolita": {
        "summary": "Increased the frequency of Lolita's shield in the mid and late game, and increased the damage and slow effect of her Ultimate. To balance this, we've reduced the shield effect granted to allies.",
        "skills": [
          {
            "name": "Passive-Noumenon Energy Core",
            "balance": "ADJUST",
            "changes": [
              "Removed the effect where the shield is periodically granted to nearby allied heroes. Shield can still be granted to nearby allied heroes when using skills.",
              "Shield Frequency: Every 6s >> Every 6-3s (scales with the Noumenon Blast level)"
            ]
          },
          {
            "name": "Skill 1-Power Charge",
            "balance": "BUFF",
            "changes": [
              "Cooldown: Fixed at 10s >> 10-8s",
              "Base Damage: 300-550 >> 400-650"
            ]
          },
          {
            "name": "Ultimate-Noumenon Blast",
            "balance": "BUFF",
            "changes": [
              "Slow Effect: 50% >> 60%",
              "Base Damage: 500-900 >> 600-1200",
              "New Passive: Each level-up reduces the interval of the shield granted by the Noumenon Energy Core by 1s."
            ]
          }
        ]
      },
      "Lukas": {
        "summary": "To improve Sacred Beast's viability in the current meta, we've increased his sustained damage capability.",
        "skills": [
          {
            "name": "Flash Step",
            "balance": "BUFF",
            "changes": [
              "Cooldown: 14-8s >> 12-8s",
              "Lightning Storm's Damage (Extra Damage): 40 >> 50-100"
            ]
          }
        ]
      },
      "Lylia": {
        "summary": "Due to Lylia's Skill 2 short casting range and Gloom's small area of effect after devouring Shadow Energy, she has struggled in the current meta. Therefore, we've increased the cast range of her Skills 1 and 2, and increased the area of effect after Gloom devours Shadow Energy.",
        "skills": [
          {
            "name": "Magic Shockwave",
            "balance": "BUFF",
            "changes": [
              "Cast Range: 7 >> 7.5"
            ]
          },
          {
            "name": "Shadow Energy",
            "balance": "BUFF",
            "changes": [
              "Range: 5 >> 5.5",
              "Area of Effect After Gloom Devours Shadow Energy: 5 >> 5.5"
            ]
          }
        ]
      },
      "Miya": {
        "summary": "Increased her early to mid game mobility and mid to late game damage.",
        "skills": [
          {
            "name": "Moon Blessing",
            "balance": "BUFF",
            "changes": [
              "Moonlight Shadow's Total Physical Attack Bonus: 20% >> 25%",
              "Moonlight Shadow's Inherited Portion of Attack Effects: 20% >> 25%"
            ]
          },
          {
            "name": "Hidden Moonlight",
            "balance": "BUFF",
            "changes": [
              "Movement Speed Bonus: 35%-65% >> 65% at all levels",
              "Area of Effect After Gloom Devours Shadow Energy: 5 >> 5.5"
            ]
          }
        ]
      },
      "Nana": {
        "summary": "Adjusted Nana's skill damage distribution by increasing Skill 1 (damage skill) and decreasing Skill 2 (control skill).",
        "skills": [
          {
            "name": "Magic Boomerang",
            "balance": "BUFF",
            "changes": [
              "Damage: 300-400 (+90% Total Magic Power) >> 300-500 (+100% Total Magic Power)"
            ]
          },
          {
            "name": "Molina Smooch",
            "balance": "NERF",
            "changes": [
              "Damage: 250-375 (+50% Total Magic Power) >> 150-275 (+30% Total Magic Power)"
            ]
          }
        ]
      },
      "Paquito": {
        "summary": "To let this skill-based Fighter unleash combos more frequently, we've made adjustments.",
        "skills": [
          {
            "name": "Jab",
            "balance": "BUFF",
            "changes": [
              "Cooldown: 8-6s >> 7-5.5s"
            ]
          },
          {
            "name": "Knockout Strike",
            "balance": "NERF",
            "changes": [
              "Cooldown: 17-13s >> 15-12s"
            ]
          }
        ]
      },
      "Rafaela": {
        "summary": "Increased Rafaela's healing and speed-up effects as a Support.",
        "skills": [
          {
            "name": "Holy Healing",
            "balance": "BUFF",
            "changes": [
              "Magic Bonus on the Additional Healing for Self and the Most Injured Allied Hero: 45% >> 65%",
              "The Movement Speed bonus increases by 1% for every 20 Magic Power >> The Movement Speed bonus increases by 1% for every 10 Magic Power"
            ]
          },
          {
            "name": "Holy Baptism",
            "balance": "BUFF",
            "changes": [
              "Cooldown: 42-34s >> 38-30s"
            ]
          }
        ]
      },
      "Tigreal": {
        "summary": "Slightly increased the hero's ability to secure kills and Ultimate damage.",
        "skills": [
          {
            "name": "Sacred Hammer",
            "balance": "BUFF",
            "changes": [
              "Charge Speed: 6 >> 8"
            ]
          },
          {
            "name": "Implosion",
            "balance": "BUFF",
            "changes": [
              "Base Damage: 270-430 >> 600-1000"
            ]
          }
        ]
      },
      "Wu Zetian": {
        "summary": "Adjusted Zetian's damage curve and Mana Cost to improve her late-game damage output.",
        "skills": [
          {
            "name": "Phoenix Strike",
            "balance": "BUFF",
            "changes": [
              "Damage for First Two Waves: 200-275 (+30% Total Magic Power) >> 150-275 (+50% Total Magic Power)",
              "Damage for the Third Wave: 385-660 (+120% Total Magic Power) >> 360-660 (+120% Total Magic Power)",
              "Mana Cost: 70-120 >> 50-75",
              "Cooldown: 6s >> 5s"
            ]
          }
        ]
      },
      "Zhuxin": {
        "summary": "Reduced Zhuxin's excessive sustained control capabilities, but increased her damage.",
        "skills": [
          {
            "name": "Crimson Butterflies",
            "balance": "NERF",
            "changes": [
              "Mana Regen from Each Crimson Butterfly: 5% >> 3%",
              "Mana Regen Interval: 0.25s >> 0.33s"
            ]
          },
          {
            "name": "Lantern Flare",
            "balance": "ADJUST",
            "changes": [
              "Base Damage: 33-88 (+28% Total Magic Power) >> 45-95 (+30% Total Magic Power) (Magic Power Bonus increased to 60% against minions)",
              "Base Smash Damage: 300-800 >> 200-300 (+10%-15% of the captured target's Max HP) (Can now capture Tigreal and throw him onto Layla, dealing damage to Layla based on Tigreal's Max HP)",
              "Soul Snare Stacking Interval: 0.25s >> 0.33s",
              "New Effect: After successfully knocking enemy heroes airborne, the target cannot be marked with Soul Snare again for 4s. During this time, this skill deals 15%-25% increased damage to that target.",
              "Mana Cost Adjustment: Applying Soul Snare to enemy heroes costs 120-150 Mana >> Activating Skill 2 costs 90 Mana every 0.33s"
            ]
          },
          {
            "name": "Crimson Beacon",
            "balance": "BUFF",
            "changes": [
              "Soul Snare Stacking Interval: 1s >> 0.5s"
            ]
          }
        ]
      },
      "Zilong": {
        "summary": "Improved Zilong's early and mid game combat ability.",
        "skills": [
          {
            "name": "Attribute",
            "balance": "NERF",
            "changes": [
              "Basic Attack Speed: 1.2 >> 1.05",
              "Physical Attack Growth: 6.65 >> 9"
            ]
          },
          {
            "name": "Dragon Flurry",
            "balance": "ADJUST",
            "changes": [
              "Basic Attack Damage: 100% Total Physical Attack >> 100 (+80% Total Physical Attack)",
              "Dragon Flurry Damage: 30 (+40% Total Physical Attack) >> 80 (+30% Total Physical Attack)",
              "Dragon Flurry Trigger Condition: Deals damage 3 times with Basic Attacks >> Deals damage 3 times with Basic Attacks or skills"
            ]
          },
          {
            "name": "Spear Strike",
            "balance": "BUFF",
            "changes": [
              "Removed Effect: Launches a Basic Attack after casting the skill."
            ]
          }
        ]
      }
    },
    "battlefield_adjustments": {
      "Mythic Battlefield": {
        "changes": [
          "Changed to [Mythical Honor Battlefield]. Mythic Battlefield's exclusive stat adjustments now only take effect after reaching Mythical Honor."
        ]
      },
      "Stat Adjustments": {
        "changes": [
          "We've noticed that in high-rank matches, more Fighters are taking the Gold Lane, severely limiting the viability of Marksmen. Therefore, we've made Mythic Honor Battlefield adjustments to address this."
        ]
      },
      "Gold Lane Siege Minion": {
        "changes": [
          "Extra Gold: 30% >> 40%"
        ]
      },
      "Base Turret": {
        "changes": [
          "HP: 7300 >> 8200"
        ]
      },
      "Base": {
        "changes": [
          "HP: 7900 >> 9000"
        ]
      },
      "Equipment Adjustments": {
        "changes": []
      },
      "Roaming Blessings": {
        "changes": [
          "Different types of Roaming heroes have different playstyles, so we've reworked how some Roaming Blessings gain extra Gold and EXP.",
          "As match time increases, Gold from minions and creeps rises, while vision reveals and damage opportunities for roamers decrease in the late game. Therefore, we've adjusted the reward values for Roaming heroes' different actions to balance the Gold income of different Roaming styles.",
          "[Conceal]",
          "No longer gains income from minions and creeps killed by nearby allies.",
          "New Effect: Gain (30 + 2* Hero Level) Gold and (20 + 8* Hero Level) EXP after dealing damage to enemy heroes. Cooldown: 15s.",
          "Gold Gained from Vision Reveal: 30 >> 30 (+ 1* Hero Level)",
          "EXP Gained from Vision Reveal: 30 in first 2 min, 60 after 2 min >> 25 + (5* Hero Level)",
          "Gold Gained Every 5s After 8 Min: 9 >> 10",
          "EXP Gained Every 5s After 8 Min: 18 >> 20",
          "[Dire Hit]",
          "No longer gains income from minions and creeps killed by nearby allies.",
          "New Effect: Gain (30 + 2* Hero Level) Gold and (20 + 8* Hero Level) EXP after dealing damage to enemy heroes. Cooldown: 15s.",
          "Gold Gained from Vision Reveal: 30 >> 30 (+ 1* Hero Level)",
          "EXP Gained from Vision Reveal: 30 in first 2 min, 60 after 2 min >> 25 + (5* Hero Level)",
          "Gold Gained Every 5s After 8 Min: 9 >> 10",
          "EXP Gained Every 5s After 8 Min: 18 >> 20",
          "[Encourage]",
          "Income from Minions and Creeps Killed by Nearby Allies: 40% >> 35%",
          "Grants nearby allied heroes 20 Hybrid Defense.",
          "Gold Gained from Vision Reveal: 30 >> 30 (+ 1* Hero Level)",
          "EXP Gained from Vision Reveal: 30 in first 2 min, 60 after 2 min >> 25 + (5* Hero Level)",
          "Gold Gained Every 5s After 8 Min: 9 >> 10",
          "EXP Gained Every 5s After 8 Min: 18 >> 20",
          "[Favor]",
          "Income from Minions and Creeps Killed by Nearby Allies: 40% >> 35%",
          "Gold Gained from Vision Reveal: 30 >> 30 (+ 1* Hero Level)",
          "EXP Gained from Vision Reveal: 30 in first 2 min, 60 after 2 min >> 25 + (5* Hero Level)",
          "Gold Gained Every 5s After 8 Min: 9 >> 10",
          "EXP Gained Every 5s After 8 Min: 18 >> 20"
        ]
      },
      "Demon Hunter Sword": {
        "changes": [
          "[Demon Hunter Sword]",
          "AttributesBUFF",
          "Removed 8% Lifesteal.",
          "Unique Passive - DevourREVAMP",
          "Basic Attacks grant 2% Lifesteal >> Each Basic Attack recovers (20+4* Hero Level) HP, and counts as an Attack Effect"
        ]
      },
      "Rose Gold Meteor": {
        "changes": [
          "[Rose Gold Meteor]",
          "Adjusted the equipment scaling to make it easier to reach the max Hybrid Defense from equipment. Removed the dependency on Lifesteal from Basic Attacks to improve flexibility, and slightly reduced Physical Attack for balance.",
          "AttributesNERF",
          "Physical Attack: 40 >> 30",
          "Unique Passive - Dragon Scale]BUFF",
          "Every 1% Lifesteal increases Hybrid Defense by 1 >> Every 4 extra Physical Attack increases Hybrid Defense by 1",
          "Unique Passive - Lifeline]BUFF",
          "This effect now requires taking damage from enemy heroes to trigger."
        ]
      },
      "Queen's Wings": {
        "changes": [
          "[Queen's Wings]",
          "Adjusted the equipment scaling to make it easier to reach the max Hybrid Defense from equipment. Removed the dependency on Lifesteal from Basic Attacks to improve flexibility, and slightly reduced Physical Attack for balance.",
          "AttributesNERF",
          "Optimized Queen's Wings' Passive - Demonize. This effect now requires taking damage from enemy heroes to trigger."
        ]
      },
      "Battle Spells": {
        "changes": []
      },
      "Ice Retribution": {
        "changes": [
          "[Ice Retribution]",
          "Slightly reduced Ice Retribution's control and kiting potential.",
          "AttributesNERF",
          "Movement Speed Stolen: 70 (+2* Hero Level) >> 50 (+2* Hero Level)"
        ]
      },
      "Vengeance": {
        "changes": [
          "[Vengeance]",
          "We found that some offensive Fighters using Vengeance posed too great a threat to the backline, so we've reduced its damage to the attacker.",
          "AttributesNERF",
          "Damage: 35% of damage taken (before reduction) >> 25% of damage taken (before reduction)"
        ]
      },
      "Battlefield Adjustments": {
        "changes": [
          "cIn-match Quick Communication",
          "Optimized signal trigger timing and added 4 new signals: Enemy No Ultimate, Enemy Invading Jungle, Enemy No Battle Spell, and Enemy No Active Equipment."
        ]
      }
    },
    "system_adjustments": [
      "S38 will end at 21:59:59 on 12/17 (Server Time).",
      "S39 will start from 00:00:00 on 12/18 (Server Time). Complete Ranked matches to claim rewards, including S39 Seasonal Skin: Balmond \"Ironhide Berserker\" and S39 Avatar Border \"Cloudrise\".",
      "We wish you an enjoyable gaming experience and smooth rank progression!",
      "[Surprise Flip Rewards Update]",
      "The following rewards are exclusive to Surprise Flip:",
      "Added 4 Aurora-themed Battle Emotes and an Aurora-themed Avatar Border.",
      "[MLBB Rising Open Optimizations]",
      "You can now gain Hero Power in the MLBB Rising Open system. As your MRO level increases, the Hero Power bonus also increases.",
      "You can now view your MLBB Rising Open stats in Profile - Battlefield - Statistics.",
      "You can now preview Pack items and the guaranteed draw count directly in the MLBB Rising Open Shop.",
      "[New Free Recording]",
      "You can enable this feature in Settings - Free Recording to view and share your recorded videos. Once enabled, a draggable floating recording button will appear in matches, allowing you to quickly record gameplay highlights (due to performance considerations, this feature is disabled on some low-performance devices).",
      "[Battle Achievement Video Sharing]",
      "You can tap to record the full animation on the Battle Achievement screen. The recorded video can be shared on social platforms or saved locally (due to performance considerations, this feature is disabled on some low-performance devices).",
      "[Highlights Notification Optimizations]",
      "Added \"Clutch Control\" highlight. Trigger condition: Perform Clutch Control in team fights and assist allies in killing key enemy heroes.",
      "Added \"Superb AOE / Brilliant AOE / Flawless AOE\" highlights. Trigger condition: Hit multiple enemies with an AOE skill, deal massive damage, and secure kills.",
      "[Result Screen Optimization]",
      "On the Result Screen, tap another player's avatar to view their Namecard. You can also view the basic info and skill info of the hero they played in this match within the Namecard.",
      "[Other]",
      "To avoid confusion regarding the seasonal squad verification badges, we have optimized the display of the squad verification badge for the Top 20 squads of each season."
    ]
  }
]