[
  {
    "version": "2.1.40",
    "release_date": "2025-12-18",
    "new_hero": {
      "name": "Sora",
      "title": "Shifting Cloud",
      "description": "Hero Feature: Adaptable cloud warrior with multiple combat styles.",
      "skills": []
    },
    "hero_adjustments": {
      "Angela": {
        "summary": "Movement Speed Boost per Stack: 7.5% >> 5% New Effect: When attached, this skill's cooldown is reduced by 50%. Attaching State Duration: 12s >>20s Shield Duration: 6s >> the shield remains until detached Adjusted the cooldown mechanics to start immediately after casting the Ultimate.",
        "changes": [
          "Increased the duration of Angela's Ultimate when attached to allies and the cast frequency of Skill 1. Additionally, the cooldown now runs while attached.",
          "To balance, we've reduced the Movement Speed boost of the Passive and increased the cooldown of the Ultimate.",
          "Movement Speed Boost per Stack: 7.5% >> 5%",
          "Cooldown: 7s >> 8s",
          "New Effect: When attached, this skill's cooldown is reduced by 50%.",
          "Cooldown: 20s >>60s",
          "Attaching State Duration: 12s >>20s",
          "Shield Duration: 6s >> the shield remains until detached",
          "Adjusted the cooldown mechanics to start immediately after casting the Ultimate."
        ]
      },
      "Atlas": {
        "summary": "Damage: 215-390 (+60% Total Magic Power) >> 400-600 (+100% Total Magic Power) New Effect: Each target can be damaged only once.",
        "changes": [
          "Damage: 215-390 (+60% Total Magic Power) >> 400-600 (+100% Total Magic Power)"
        ]
      },
      "Aurora": {
        "summary": "New Effect: Gain 0.06s additional freezing time for every 100 Magic Power.",
        "changes": [
          "Aurora was slightly underperforming among Mages. Therefore, we've enhanced her overall ability scaling.",
          "New Effect: Gain 0.06s additional freezing time for every 100 Magic Power."
        ]
      },
      "Barats": {
        "summary": "New Effect: If the Ultimate misses, its cooldown will be reduced by 50%. New Effect: If the Ultimate hits, Detona immediately gains max stacks of Big Guy. Effect Change: 60% cooldown refund when the cast is canceled >> 50% cooldown refund when the cast is canceled Removed Effect: Detona gains Big Guy stacks upon respawn. HP Bonus of the Additional Damage: 1.8% Total HP >> 5% Total HP",
        "changes": [
          "The payoff for landing Barats' Ultimate was low, while missing it was too punishing. Therefore, we've made some adjustments to improve this.",
          "New Effect: If the Ultimate misses, its cooldown will be reduced by 50%.",
          "New Effect: If the Ultimate hits, Detona immediately gains max stacks of Big Guy.",
          "Effect Change: 60% cooldown refund when the cast is canceled >> 50% cooldown refund when the cast is canceled",
          "Removed Effect: Detona gains Big Guy stacks upon respawn.",
          "HP Bonus of the Additional Damage: 1.8% Total HP >> 5% Total HP"
        ]
      },
      "Estes": {
        "summary": "Sustained Healing: 250-400 (+60% Total Magic Power) >> 360-585 (+90% Total Magic Power) Duration of Hybrid Defense Increase: 3s >> 5s Enhanced Moonlight Immersion doubles the Hybrid Defense increase. Optimized the skill description.",
        "changes": [
          "Enhanced Estes's sustained healing and the ability to protect fragile heroes.",
          "Sustained Healing: 250-400 (+60% Total Magic Power) >> 360-585 (+90% Total Magic Power)",
          "Duration of Hybrid Defense Increase: 3s >> 5s",
          "Cooldown: 11-7s >> 11-8.5s",
          "Mana Cost: 110-210 >> 60-120",
          "Enhanced Moonlight Immersion doubles the Hybrid Defense increase."
        ]
      },
      "Freya": {
        "summary": "Cooldown: 54-46s (Starts on cast) >> 34-26s (Starts after cast) Gains 50% damage reduction while diving down. Slightly increased the speed when diving down.",
        "changes": [
          "Freya's combat effectiveness was relatively weak without her Ultimate. To improve balance while preserving her highlight performance during Ultimate, we've reduced its cooldown.",
          "Cooldown: 54-46s (Starts on cast) >> 34-26s (Starts after cast)"
        ]
      },
      "Gatotkaca": {
        "summary": "Taunt Duration: Fixed 1.5s >> 0.9-1.5s (scales with channel time) Sprint Distance: 3-4.4 >> 2.2-4.4",
        "changes": [
          "Compared to other Tank heroes, the control duration of Gatotkaca's Skill 2 was too long and easy to cast.",
          "Taunt Duration: Fixed 1.5s >> 0.9-1.5s (scales with channel time)",
          "Sprint Distance: 3-4.4 >> 2.2-4.4"
        ]
      },
      "Granger": {
        "summary": "No longer deals additional damage to minions and creeps.",
        "changes": [
          "Granger has been crowding out other Marksmen in the Gold Lane. To address this, we've reduced his early to mid game scaling and damage output.",
          "Base Damage: 60-120 >> 60-100",
          "No longer deals additional damage to minions and creeps."
        ]
      },
      "Grock": {
        "summary": "Removed Effect: Gains Control Immunity while casting skills. New Effect: The skill cannot be interrupted. New Effect: Gains Control Immunity while charging.",
        "changes": [
          "Grock boasted incredible durability and could gain Control Immunity from his Passive. Therefore, we've slightly reduced his ability. Grock can still cast his skills uninterrupted, but he will be affected by control effects.",
          "Removed Effect: Gains Control Immunity while casting skills."
        ]
      },
      "Harith": {
        "summary": "Enhanced Basic Attack Damage Bonus: 90% Total Physical Attack (+90% Total Magic Power) >> 100% Total Physical Attack (+60% Total Magic Power) Shield: 120-270 (+100% Total Magic Power) >> 120-270 (+120% Total Magic Power) (up to 3 stacks). Enhanced Basic Attacks only deal 50-100 and normal Basic Attack damage to Turrets.",
        "changes": [
          "Harith has been crowding out other Marksmen in the Gold Lane. To address this, his mid to late game damage has been reduced, while his survivability has been increased to adjust his power curve.",
          "Enhanced Basic Attack Damage Bonus: 90% Total Physical Attack (+90% Total Magic Power) >> 100% Total Physical Attack (+60% Total Magic Power)",
          "Shield: 120-270 (+100% Total Magic Power) >> 120-270 (+120% Total Magic Power) (up to 3 stacks).",
          "Enhanced Basic Attacks only deal 50-100 and normal Basic Attack damage to Turrets."
        ]
      },
      "Hayabusa": {
        "summary": "Reduced Hayabusa's and his phantoms' travel distance by 20%.",
        "changes": [
          "Hayabusa's Skill 2 allowed him to reach the backline too easily. For balance, we've reduced its distance. To compensate, we've also increased his skill cast frequency.",
          "Reduced Hayabusa's and his phantoms' travel distance by 20%.",
          "Cooldown: 20-16s >> 16-14s",
          "Cooldown: 50s >> 40s"
        ]
      },
      "Khufra": {
        "summary": "Improved Khufra's poke capability in the early to mid game.",
        "changes": [
          "Improved Khufra's poke capability in the early to mid game.",
          "Cooldown: 12s >> 8s"
        ]
      },
      "Leomord": {
        "summary": "Leomord's Basic Attacks and skills gain 25 Oath Keeper energy for each target damaged. When the energy reaches 100, his next Basic Attack deals 200% Crit Damage and recovers 100 (+10* Hero Level) (+12% Extra Max HP) HP. Leomord's Basic Attacks cannot normally Crit, and every 1% Crit Chance is converted to 1% Crit Damage. Mounted State: Each Oath Keeper energy gain is increased by 200%. Removed the effect of gaining a shield. New Effect: Damage against creeps increases to 200%.",
        "changes": [
          "Leomord's Passive relied on enemies being at low health to be effective, which didn't align with our design expectations. We want Leomord to take the initiative by gaining Oath Keeper energy through combat to deal Crit Damage while recovering HP for sustainability, making him a knight capable of charging into battle.",
          "We've also increased Skill 1's damage against creeps to improve Leomord's jungle clearing efficiency.",
          "To balance this, we've removed the shield granted in skill 1.",
          "Leomord's Basic Attacks and skills gain 25 Oath Keeper energy for each target damaged. When the energy reaches 100, his next Basic Attack deals 200% Crit Damage and recovers 100 (+10* Hero Level) (+12% Extra Max HP) HP.",
          "Leomord's Basic Attacks cannot normally Crit, and every 1% Crit Chance is converted to 1% Crit Damage.",
          "Mounted State: Each Oath Keeper energy gain is increased by 200%.",
          "New Effect: Damage against creeps increases to 200%."
        ]
      },
      "Lolita": {
        "summary": "Removed the effect where the shield is periodically granted to nearby allied heroes. Shield can still be granted to nearby allied heroes when using skills. Shield Frequency: Every 6s >> Every 6-3s (scales with the Noumenon Blast level) Cooldown: Fixed at 10s >> 10-8s Base Damage: 300-550 >> 400-650 Base Damage: 500-900 >> 600-1200 New Passive: Each level-up reduces the interval of the shield granted by the Noumenon Energy Core by 1s.",
        "changes": [
          "Increased the frequency of Lolita's shield in the mid and late game, and increased the damage and slow effect of her Ultimate.",
          "To balance this, we've reduced the shield effect granted to allies.",
          "Removed the effect where the shield is periodically granted to nearby allied heroes. Shield can still be granted to nearby allied heroes when using skills.",
          "Shield Frequency: Every 6s >> Every 6-3s (scales with the Noumenon Blast level)",
          "Cooldown: Fixed at 10s >> 10-8s",
          "Base Damage: 300-550 >> 400-650",
          "Slow Effect: 50% >> 60%",
          "Base Damage: 500-900 >> 600-1200",
          "New Passive: Each level-up reduces the interval of the shield granted by the Noumenon Energy Core by 1s."
        ]
      }
    },
    "battlefield_adjustments": {
      "Mythic Battlefield": {
        "changes": [
          "Changed to [Mythical Honor Battlefield]. Mythic Battlefield's exclusive stat adjustments now only take effect after reaching Mythical Honor."
        ]
      },
      "Stat Adjustments": {
        "changes": [
          "We've noticed that in high-rank matches, more Fighters are taking the Gold Lane, severely limiting the viability of Marksmen. Therefore, we've made Mythic Honor Battlefield adjustments to address this."
        ]
      },
      "Gold Lane Siege Minion": {
        "changes": [
          "Extra Gold: 30% >> 40%"
        ]
      },
      "Base Turret": {
        "changes": [
          "HP: 7300 >> 8200"
        ]
      },
      "Base": {
        "changes": [
          "HP: 7900 >> 9000"
        ]
      },
      "Equipment Adjustments": {
        "changes": []
      },
      "Roaming Blessings": {
        "changes": [
          "Different types of Roaming heroes have different playstyles, so we've reworked how some Roaming Blessings gain extra Gold and EXP.",
          "As match time increases, Gold from minions and creeps rises, while vision reveals and damage opportunities for roamers decrease in the late game. Therefore, we've adjusted the reward values for Roaming heroes' different actions to balance the Gold income of different Roaming styles."
        ]
      },
      "Demon Hunter Sword": {
        "changes": []
      },
      "Rose Gold Meteor": {
        "changes": []
      },
      "Queen's Wings": {
        "changes": []
      },
      "Battle Spells": {
        "changes": []
      },
      "Ice Retribution": {
        "changes": []
      },
      "Vengeance": {
        "changes": []
      },
      "Battlefield Adjustments": {
        "changes": [
          "cIn-match Quick Communication",
          "Optimized signal trigger timing and added 4 new signals: Enemy No Ultimate, Enemy Invading Jungle, Enemy No Battle Spell, and Enemy No Active Equipment."
        ]
      }
    },
    "system_adjustments": [
      "S38 will end at 21:59:59 on 12/17 (Server Time).",
      "S39 will start from 00:00:00 on 12/18 (Server Time). Complete Ranked matches to claim rewards, including S39 Seasonal Skin: Balmond \"Ironhide Berserker\" and S39 Avatar Border \"Cloudrise\".",
      "We wish you an enjoyable gaming experience and smooth rank progression!",
      "[Surprise Flip Rewards Update]",
      "The following rewards are exclusive to Surprise Flip:",
      "Added 4 Aurora-themed Battle Emotes and an Aurora-themed Avatar Border.",
      "[MLBB Rising Open Optimizations]",
      "You can now gain Hero Power in the MLBB Rising Open system. As your MRO level increases, the Hero Power bonus also increases.",
      "You can now view your MLBB Rising Open stats in Profile - Battlefield - Statistics.",
      "You can now preview Pack items and the guaranteed draw count directly in the MLBB Rising Open Shop.",
      "[New Free Recording]",
      "You can enable this feature in Settings - Free Recording to view and share your recorded videos. Once enabled, a draggable floating recording button will appear in matches, allowing you to quickly record gameplay highlights (due to performance considerations, this feature is disabled on some low-performance devices).",
      "[Battle Achievement Video Sharing]",
      "You can tap to record the full animation on the Battle Achievement screen. The recorded video can be shared on social platforms or saved locally (due to performance considerations, this feature is disabled on some low-performance devices).",
      "[Highlights Notification Optimizations]",
      "Added \"Clutch Control\" highlight. Trigger condition: Perform Clutch Control in team fights and assist allies in killing key enemy heroes.",
      "Added \"Superb AOE / Brilliant AOE / Flawless AOE\" highlights. Trigger condition: Hit multiple enemies with an AOE skill, deal massive damage, and secure kills.",
      "[Result Screen Optimization]",
      "On the Result Screen, tap another player's avatar to view their Namecard. You can also view the basic info and skill info of the hero they played in this match within the Namecard.",
      "[Other]",
      "To avoid confusion regarding the seasonal squad verification badges, we have optimized the display of the squad verification badge for the Top 20 squads of each season."
    ]
  }
]